# GetClLSN

## Description
Returns the line style of the specified class.&lt;BR&gt;

```pascal
FUNCTION GetClLSN(className : STRING) : LONGINT;
```

```python

def vs.GetClLSN(className):
    return LONGINT
```

## Parameters
|Name|Type|Description|
|---|---|---|
|className|STRING|Name of class.|

## See Also
VS Functions:
SetClLSN

## Version
Availability: from Vectorworks 2013
## Category
* Classes